# 习题
'''
3.循环提示用户输入:用户名、密码、邮箱
（要求用户输入的长度不超过20个字符，如果超过则只有前20个字符有效)
打印输出
用户名 	密码   邮箱
Admin   123    hfjs@163.com
Lily    111    yweuyr@163.com
如果用户输入q或Q表示不再继续输入。
/////////////////////////////////////////////////////////////////////
4.执行程序产生验证码，提示用户输入用户名，密码和验证码，如果正确，则提示登录成功，
否则重新输入。(要求产生新的验证码)

5.输入一行字符,统计其中有多少个单词,每两个单词之间以空格隔开

6.输入两个字符串，从第一字符串中删除第二个字符串中所有的字符。例如,
输入"They are students."和"aeiou"，则删除之后的第一个字符串变成"Thy r stdnts."

7.小易喜欢的单词具有以下特性:
	1).单词每个字母都是大写字母
	2).单词没有连续相等的字母

例如:
	小易不喜欢"ABBA"，因为这里有两个连续的'B'
	小易喜欢"A"，"ABA"和"ABCBA"这些单词
	给你一个单词，你要回答小易是否会喜欢这个单词。

'''